[{"sp_id":"1","sp_name":"Grafika komputerowa i projektowanie gier","sp_describe":"W ramach specjalności zostaną poruszone zagadnienia z grafiki komputerowej,\r\nprojektowania i programowania gier komputerowych.\r\nStudent pozna zagadnienia i uzyska praktyczną umiejętność używania narzędzi do grafiki\r\ndwu oraz trójwymiarowej.\r\nStudent uzyska wiedzę z zakresu podstaw oraz zaawansowanych technik programowania.\r\nNabyta wiedza umożliwi pracę na stanowiskach wszędzie tam, gdzie wymagana jest\r\nznajomość zagadnień graficznych oraz programistycznych.\r\nAbsolwent tej specjalności będzie przygotowany do pracy na takich stanowiskach, jak\r\ngrafik komputerowy (grafika 2D oraz 3D), programista grafiki wizualnej, programista.\r\nPosiadamy pięć pracowni komputerowych wyposażonych w nowoczesne\r\noprogramowanie. Zajęcia na kierunku Informatyka I prowadzone są głównie w pracowniach\r\nkształcenia praktycznego – laboratoriach komputerowych. Są to studia 3,5 letnie inżynierskie,\r\nprofil praktyczny. Gro wykładowców to praktycy. Proponujemy także warsztaty praktyczne\r\noraz zajęcia fakultatywne.","sw_id":"4"},{"sp_id":"2","sp_name":"Programowanie i bazy danych","sp_describe":"Absolwenci tej specjalności będą przygotowani do projektowania, implementowania i\nwdrażania systemów informatycznych opartych na komercyjnych i niekomercyjnych\nsystemach bazodanowych zgodnie z wymaganiami dostarczonymi przez klienta (urzędy\nadministracji, firmy ubezpieczeniowe, banki, instytucje prywatne, itp.).\nStudent uzyska wiedzę z zakresu administracji systemami zarządzania bazami danych,\nzarówno komercyjnymi, np. ORACLE, MS SQL Server, jak i niekomercyjnymi takimi, jak\nPostgreSQL, MySQL.\nW ramach tej specjalności poruszone zostaną zaawansowane aspekty programowania w\nróżnych językach programowania. Studenci poznają języki Ada, C, C++, Java SE, Java EE,\nJ2ME, C#, .Net.\nPonadto student tej specjalności pozyska umiejętności pozwalające na podjęcie pracy w\ncharakterze programisty lub administratora systemów bazodanowych w różnych\nprzedsiębiorstwach, korporacjach oraz małych i średnich firmach.\nPosiadamy pięć pracowni komputerowych wyposażonych w nowoczesne\noprogramowanie. Zajęcia na kierunku Informatyka I prowadzone są głównie w pracowniach\nkształcenia praktycznego – laboratoriach komputerowych. Są to studia 3,5 letnie inżynierskie,\nprofil praktyczny. Gro wykładowców to praktycy. Proponujemy także warsztaty praktyczne\noraz zajęcia fakultatywne.","sw_id":"4"},{"sp_id":"3","sp_name":"Sieci komputerowe i sieciowe systemy operacyjne","sp_describe":"Specjalność ta będzie ukierunkowana na oprogramowanie komunikacyjne, instalację i\r\ntworzenie sieci LAN i WAN, architektury logiczne sieci, administrowanie i zarządzanie\r\nsieciami.\r\nNa zajęciach tej specjalności będą poruszone także zagadnienia użytkowania i\r\nprojektowania systemów teleinformatycznych (sieci przewodowe i bezprzewodowe) oraz\r\nwsparcia technologii webowych.\r\nStudent uzyska praktyczną wiedzę z zakresu administracji systemami operacyjnymi,\r\nszczególnie systemami Unix, Linux i Windows Server.\r\nAbsolwent będzie mógł pracować z systemami operacyjnymi w różnych klasach i typach\r\nurządzeń sieciowych oraz będzie w stanie samodzielnie projektować, zarządzać oraz\r\nintegrować sieci komputerowe.\r\nPosiadamy pięć pracowni komputerowych wyposażonych w nowoczesne\r\noprogramowanie. Zajęcia na kierunku Informatyka I prowadzone są głównie w pracowniach\r\nkształcenia praktycznego – laboratoriach komputerowych. Są to studia 3,5 letnie inżynierskie,\r\nprofil praktyczny. Gro wykładowców to praktycy. Proponujemy także warsztaty praktyczne\r\noraz zajęcia fakultatywne. Proponujemy także pracownię praktyczną do stworzenia sieci.","sw_id":"4"},{"sp_id":"4","sp_name":"Matematyka bankowa i ubezpieczeniowa","sp_describe":"Program specjalności obejmuje, oprócz podstawowych przedmiotów matematycznych, głównie przedmioty przygotowujące przyszłych absolwentów do pracy w firmach ubezpieczeniowych, bankach, instytucjach finansowych jak i do prowadzenia małych i większych firm. Liczne umowy z instytucjami gwarantują odbywanie praktyk zawodowych na wysokim poziomie. Ukończenie tej specjalności na studiach pierwszego i drugiego stopnia powinno ułatwić zdanie państwowego egzaminu na aktuariusza. Celem studiów jest także nabycie umiejętności praktycznego posługiwania się narzędziami informatycznymi w różnego rodzaju operacjach bankowych, ubezpieczeniowych, księgowych i bazodanowych oraz umiejętności programowania.","sw_id":"5"},{"sp_id":"5","sp_name":"Edukacja obronna z bezpieczeństwem wewnętrznym","sp_describe":"Przygotowanie z zakresu pedagogiki i współczesnych zagadnień obronności i bezpieczeństwa wewnętrznego, nabycie umiejętności przewidywania i podejmowania decyzji w warunkach zagrożenia bezpieczeństwa, organizacji działań zbiorowych w sytuacjach wyjątkowych, zarządzania sytuacjami kryzysowymi oraz nabycie niezbędnej wiedzy z zakresu zagadnień społecznych i prawnych.\r\n\r\nPosiadane kwalifikacje oraz uprawnienia zawodowe: tytuł zawodowy licencjata, przygotowanie pedagogiczne do pracy w szkołach różnego typu w charakterze pedagoga szkolnego, przygotowanie do pracy  na stanowiskach specjalistycznych w strukturach administracji państwowej i samorządowej odpowiedzialnej za bezpieczeństwo wewnętrzne, w zespołach zarządzania kryzysowego, obronie cywilnej, w formacjach i służbach państwowych związanych z bezpieczeństwem, m.in.: Policji, Agencji Bezpieczeństwa Wewnętrznego, Straży Granicznej, Służbie Więziennej czy Straży Miejskiej oraz w   charakterze pracowników cywilnych, w firmach świadczących usługi z zakresu ochrony osób i mienia.","sw_id":"11"},{"sp_id":"6","sp_name":"Edukacja wczesnoszkolna z wychowaniem przedszkolnym","sp_describe":"Absolwenci w\/w specjalności  uzyskają  rozległą wiedzę teoretyczną i praktyczną, będą przygotowani do realizacji edukacyjnych, wychowawczych oraz opiekuńczych zadań współczesnej edukacji elementarnej realizowanej w przedszkolu i szkole podstawowej w zakresie nauczania zintegrowanego, czyli do pracy z dziećmi w wieku 3-9 lat.\r\n\r\nPosiadane kwalifikacje oraz uprawnienia zawodowe: tytuł zawodowy licencjata, kwalifikacje do pracy edukacyjnej, opiekuńczej i wychowawczej realizowanej w przedszkolu i szkole podstawowej w zakresie nauczania zintegrowanego (klasy I-III).  Ponadto absolwent posiada kompetencje w zakresie diagnozowania i stymulowania rozwoju dziecka, umiejętność efektownego komunikowania się ze środowiskiem dziecka, umiejętność samooceny i kierowania własnym rozwojem.","sw_id":"11"},{"sp_id":"7","sp_name":"Pedagogika opiekuńczo-wychowawcza z arteterapią","sp_describe":"Przygotowanie do podejmowania działań o charakterze wychowawczym, profilaktycznym, wspierającym, kompensacyjnym,  terapeutycznym oraz animacyjnym w środowisku społecznym.\r\n\r\nPosiadane kwalifikacje oraz uprawnienia zawodowe: tytuł zawodowy licencjata, przygotowanie pedagogiczne do pracy w placówkach opiekuńczo – wychowawczych takich jak: dom dziecka, pogotowie opiekuńcze, świetlica środowiskowa, świetlica szkolna, świetlica terapeutyczna, ośrodek szkolno-wychowawczy, a także w ośrodkach rehabilitacyjnych, rewalidacyjnych, resocjalizacyjnych, socjalizacyjnych i geriatrycznych.","sw_id":"11"},{"sp_id":"8","sp_name":"Filologia angielska","sp_describe":"Nadrzędnym celem kształcenia jest rozwinięcie kompetencji językowych studenta w zakresie języka angielskiego  do poziomu C1. Student uzyskuje podstawową wiedzę o języku, literaturze, kulturze i historii angielskiego obszaru językowego. Nabywa umiejętności filologiczne z zakresu analizy i interpretacji tekstu czytanego i słuchanego oraz tworzenia tekstu pisanego. Rozwija umiejętność twórczego korzystania z informacji oraz krytycznego i kreatywnego myślenia.\r\n\r\nProgram studiów przewiduje wyposażenie absolwenta w szereg kompetencji specjalistycznych, niezbędnych do wykonywania zawodów wykorzystujących znajomość języka angielskiego. Po pierwszym roku studenci mają możliwość wyboru pomiędzy programem glottodydaktycznym a translatorycznym. W zakresie programu glottodydaktycznego absolwenci są przygotowani do kompleksowej realizacji edukacyjnych, wychowawczych oraz opiekuńczych zadań współczesnej szkoły. Zdobywają wiedzę i umiejętności niezbędne do wykonywania zawodu nauczyciela języka angielskiego w przedszkolach i szkołach podstawowych. Kształcenie w zakresie programu translatorycznego daje absolwentowi przygotowanie do podjęcia pracy tłumacza w firmach i instytucjach, w których wymagana jest bardzo dobra znajomość języka angielskiego. Absolwenci nabywają wiedzę i umiejętności przekładu tekstów pisanych i ustnych na język angielski i z języka angielskiego, co pozwala im na podjęcie pracy w szeroko rozumianej przestrzeni publicznej, w sferach biznesu, mediów i turystyki. Program studiów, poszerzony o komponent kulturoznawczy, pozwala rozwijać umiejętności w zakresie tłumaczeń tekstów literackich, filmowych i innych tekstów z obszaru kultury.\r\n\r\n ","sw_id":"14"},{"sp_id":"9","sp_name":"Język angielski w turystyce i biznesie","sp_describe":"Program studiów przewiduje osiągnięcie przez studentów wysokiej kompetencji językowej w zakresie języka angielskiego (poziom C1). Dzięki zintensyfikowaniu zajęć kursu praktycznej nauki języka angielskiego na pierwszym roku program studiów pozwala na uzupełnienie i rozwinięcie środków językowych odpowiednich dla kierunku filologicznego. Absolwent tej specjalności posiada wysokie kompetencje językowe z zakresu terminologii turystycznej i biznesowej. W ramach przedmiotów kierunkowych student zdobywa wiedzę z dziedzin językoznawstwa, literaturoznawstwa i kulturoznawstwa obszaru anglojęzycznego. Wiedza ta zapewni przygotowanie do pracy w organizacjach z sektora turystyki i biznesu, gdzie istotną rolę odgrywa dobra znajomość kultury i języka. Absolwent specjalności może podjąć pracę w charakterze tłumacza języka angielskiego w firmach lub instytucjach współpracujących z krajami angielskiego obszaru językowego, w tym także w instytucjach samorządu terytorialnego i instytucjach centralnych.\r\n\r\nPo pierwszym roku studenci mają możliwość wyboru pomiędzy programem nakierowanym na język angielski w turystyce lub na język angielski w biznesie. W zakresie programu „język angielski w turystyce” absolwenci zostaną przygotowani do realizacji zadań z obszaru turystyki, poznają m.in. współczesny rynek turystyczny, tajniki pracy przewodnika i sztukę pilotażu turystycznego. Specjalizacja „język angielski w biznesie” wyposaży natomiast studenta w wiedzę i umiejętności z obszaru przedmiotów związanych z przedsiębiorczością, problematyką języka specjalistycznego i organizacją pracy biurowej.","sw_id":"14"},{"sp_id":"10","sp_name":"Kosmetologia","sp_describe":"Kształcenie na kierunku Kosmetologia będzie bazować na współczesnych  zdobyczach wiedzy i technologii w zakresie kosmetologii. Obejmować będzie  zagadnienia umożliwiające wykształcenie określonych umiejętności praktycznych związanych z upiększaniem, składem preparatów kosmetycznych i ich zastosowaniem oraz wpływem na poszczególne rodzaje skóry oraz profilaktyką mającą na celu opóźnienie zewnętrznych oznak starzenia się, jak i zachowania jak najdłużej sprawności życiowej, a także zagadnieniami leczniczymi dotyczącymi tych zmian skórnych, które szczególnie niekorzystnie wpływają na wygląd zewnętrzny.\r\n\r\nZnaczącą  liczbę godzin będą stanowić zajęcia praktyczne, w trakcie których student zdobędzie wiedzę i nabierze umiejętności zawodowych uczestnicząc w takich zajęciach jak np.: kosmetologia pielęgnacyjna, upiększająca, wizaż i stylizacja, charakteryzacja, makijaż sceniczny, fizjoterapia i masaż, SPA, Wellnes, odnowa biologiczna, modelowanie sylwetki oraz nowoczesne aktywności ruchowej, masaż limfatyczny. Studenci zapoznają się również z ważnymi dla zawodu przedmiotami kształcenia ogólnego i podstawowego jak na przykład: anatomia z histologią i patofizjologii, biochemia, biologia medyczna,  genetyka, biofizyka, mikrobiologia, immunologia, farmakologia, higiena, chemia kosmetyczna, podstawy receptury kosmetycznej, dermatologia, estetyka, psychologia, etyka zawodowa, technologia informacyjna, ochrona własności intelektualnej, język obcy, wychowanie fizyczne itd.\r\n\r\nIntegralną część procesu nauczania stanowić będą praktyki zawodowe, których odbycie będzie warunkiem zaliczenia studiów.\r\n\r\nW zakresie wszystkich przedmiotów studentów będą obowiązywać minima programowe ustalone w programie studiów. Zajęcia odbywać się będą w formie wykładów, seminariów i ćwiczeń, w tym ćwiczeń praktycznych w laboratoriach i pracowniach kształcenia kierunkowego pod nadzorem wykładowcy lub asystenta oraz praktyk zawodowych w wybranych gabinetach kosmetycznych, ośrodkach SPA, salonach odnowy biologicznej, gabinecie charakteryzacji teatru. Zajęcia praktyczne i praktyki zawodowe będą realizowane w grupach odpowiednio 8-16 osobowych i 8 osobowych, natomiast aktywne formy teoretyczne w grupach 20 osobowych, za wyjątkiem anatomii z histologią i fizjologii, w ramach których ćwiczenia będą prowadzone w grupach 10 osobowych ze względu na wykorzystywanie fantomów i symulatorów.\r\n\r\nWykłady i ćwiczenia będą się odbywać w bardzo dobrze przygotowanych salach wykładowych i pracowniach kierunkowych, dysponujących nowoczesnym wyposażeniem dydaktycznym i multimedialnym.\r\n\r\nW ramach ćwiczeń praktycznych uwaga będzie szczególnie zwracana na pracę studenta z klientem oraz kształtowanie właściwej postawy zawodowej. Wiedza studentów weryfikowana będzie przeprowadzanymi sprawdzianami: pisemnymi, ustnymi, praktycznymi i egzaminami.\r\n\r\nStudenci będą otrzymywać specjalne dzienniczki umiejętności praktycznych, w których odnotowywane będzie nabywanie i ugruntowywanie umiejętności zawodowych i osiągniętych efektów kształcenia zawodowego na poszczególnych etapach kształcenia. Zaliczenie poszczególnych przedmiotów odbywać się będzie na podstawie egzaminu lub zaliczenia z oceną. Nauczanie z przedmiotów kierunkowych kończyć się będzie egzaminem.","sw_id":"10"}]